---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ExternalService.IExternalService
source: html/33a9c23c-cdcd-978c-cb71-b532a902a5d2.htm
---
# IExternalService Members

Implement this method to execute the given server.